{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\u0012\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018}\u0000\u0000|\u0000\u0000S)\u0003\u00fa5\n        Normalize image in the range -0.5 + 0.5\n    \u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0004\u0000\u0000\u0000r\u0004\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u000enormalizeImage\u0085\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0004\u000e\u0001", null, null], "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "trainable": true, "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_1", "bias": true, "nb_filter": 24, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_2", "bias": true, "nb_filter": 36, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_3", "bias": true, "nb_filter": 48, "W_constraint": null, "b_regularizer": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "nb_col": 3, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_4", "bias": true, "nb_filter": 64, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "nb_col": 3, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_5", "bias": true, "nb_filter": 64, "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "output_dim": 100, "b_constraint": null, "input_dim": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "output_dim": 50, "b_constraint": null, "input_dim": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "output_dim": 10, "b_constraint": null, "input_dim": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "bias": true, "W_constraint": null, "b_regularizer": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "input_dim": null, "trainable": true}}], "keras_version": "1.1.2"}